{"talks": [{"code": "CFEMBK", "title": "Contributor Jam", "abstract": "What is the Contributor Jam? | The Contributor Jam will offer attendees an immersive opportunity to work closely with Open OnDemand (OOD) developers. Participants will gain an understanding of OOD's components and leave with the knowledge and tools to contribute to its development.", "speakers": ["NMMEVT", "S8CX8K"], "submission_type_id": 12, "track": 5, "start": "2025-03-17T13:00:00-04:00", "end": "2025-03-17T17:00:00-04:00", "room": 2, "featured": false}, {"code": "TJNP7W", "title": "Integrating XDMoD with OnDemand", "abstract": "This tutorial will demonstrate how to integrate XDMoD job statistics graphics on the OnDemand dashboard and how to configure XDMoD to aggregate OnDemand usage logs.", "speakers": ["7HLYWH"], "submission_type_id": 7, "track": 1, "start": "2025-03-18T08:00:00-04:00", "end": "2025-03-18T09:30:00-04:00", "room": 1, "featured": false}, {"code": "Z8XYSF", "title": "From 0 to OOD: How to install Open On Demand with Keycloak and Slurm integration.", "abstract": "This tutorial provides an introduction to how to install and configure Open On Demand, Slurm and Keycloak. Open OnDemand offers a user-friendly web interface for managing HPC resources, allowing users to submit jobs, access files, and utilize interactive applications easily. Slurm, a robust workload manager, is introduced for efficient job scheduling and resource allocation in HPC clusters. Keycloak, an open-source identity and access management solution, is integrated to enhance security through authentication and authorization. By following this tutorial, users will gain practical knowledge and skills to deploy a seamless and secure HPC environment on their own PCs.", "speakers": ["DNNSNU"], "submission_type_id": 7, "track": 1, "start": "2025-03-18T08:00:00-04:00", "end": "2025-03-18T09:30:00-04:00", "room": 2, "featured": false}, {"code": "V3PHZJ", "title": "Extending Functionality with Initializers", "abstract": "OOD can leverage initializers to customize or provide extended options when generating forms, and using other OOD features. This talk covers what initializers are, how to set them up, and example initializers for different functions.", "speakers": ["MHPPMS"], "submission_type_id": 7, "track": 1, "start": "2025-03-18T10:00:00-04:00", "end": "2025-03-18T11:30:00-04:00", "room": 1, "featured": false}, {"code": "SWLTCA", "title": "Deploying a user-facing system status application with NextJS and OOD", "abstract": "A tutorial for getting a NextJS node status application set up with OOD.", "speakers": ["LUTE9X"], "submission_type_id": 7, "track": 1, "start": "2025-03-18T10:00:00-04:00", "end": "2025-03-18T11:30:00-04:00", "room": 2, "featured": false}, {"title": {"en": "Lunch"}, "start": "2025-03-18T15:30:00Z", "end": "2025-03-18T12:30:00-04:00", "room": 1}, {"code": "TPGRMP", "title": "Open OnDemand @ Harvard IQSS", "abstract": "This talk gives a high-level overview of our user-centered, collaborative approach to infrastructure operations and software development for Open OnDemand at Harvard IQSS.  We highlight past, present, and future projects for Open OnDemand feature development.  This talk can serve as a springboard for a number of other presentations as needed to share more in-depth experiences with Open OnDemand.", "speakers": ["UNTF39"], "submission_type_id": 1, "track": 4, "start": "2025-03-18T13:00:00-04:00", "end": "2025-03-18T13:25:00-04:00", "room": 1, "featured": false}, {"title": {"en": "Platinum Sponsor Talk - Cambridge Computing"}, "start": "2025-03-18T17:30:00Z", "end": "2025-03-18T14:00:00-04:00", "room": 1}, {"code": "WQFEUA", "title": "Microsoft Windows through OOD: easy, fast, secure, and scalable", "abstract": "Not all commercially available software will run on Linux or Wine, compelling researchers to request Windows in HPC environments. Traditional solutions demand dedicated servers, Active Directory infrastructure, and specialized IT staff. 7lbd (7-layer bean dip) is an open-source project that eliminates this overhead by treating Windows as \"just another Open OnDemand application,\" allowing users to launch secure Windows desktops in an isolated environment anywhere on their cluster while maintaining access to all of the user’s files. This solution simplifies Windows to a level that even Linux systems administrators will find easy to maintain.", "speakers": ["NK9DBW"], "submission_type_id": 1, "track": 2, "start": "2025-03-18T14:00:00-04:00", "end": "2025-03-18T14:25:00-04:00", "room": 1, "featured": false}, {"code": "PUWKRB", "title": "Fungible Slurm clusters with Open OnDemand and Azure CycleCloud", "abstract": "Learn how to build on-demand Slurm clusters using the Azure CycleCloud workspace for Slurm and extend it with an Open OnDemand portal connected to Slurm. This talk will provide you with technical know-how and practical insights to efficiently leverage these tools, ensuring your Azure computational resources are both scalable and flexible.", "speakers": ["CXXGKD"], "submission_type_id": 1, "track": 3, "start": "2025-03-18T14:00:00-04:00", "end": "2025-03-18T14:25:00-04:00", "room": 2, "featured": false}, {"title": {"en": "OOD Dev Team Rountables"}, "start": "2025-03-18T18:30:00Z", "end": "2025-03-18T15:00:00-04:00", "room": 1}, {"title": {"en": "Break"}, "start": "2025-03-18T19:00:00Z", "end": "2025-03-18T15:30:00-04:00", "room": 1}, {"code": "ZHJDGC", "title": "Deploying LLM web applications on Open OnDemand: experiences at Perth Children's Hospital", "abstract": "Open OnDemand (OOD) is ideally placed to bridge the divide between traditional shell-based batch HPC and emerging large language model (LLM) workflows. Our team deployed OOD internally at MERLIN, a small HPC research cluster located inside Perth Children’s Hospital to provide HPC resources to a range of technical and non-technical users on sensitive healthcare data. We adapted existing LLM web applications for OOD to provide a low-code playground for non-technical researchers such as medical doctors and research assistants to engage with LLM resources in a healthcare environment. This presentation will discuss the rationale, and implementation of OOD LLM web applications in a highly restricted environment and motivate future improved support for these types of workflows within OOD.", "speakers": ["MVBZY3", "UU9PCJ"], "submission_type_id": 1, "track": 11, "start": "2025-03-18T15:30:00-04:00", "end": "2025-03-18T15:55:00-04:00", "room": 1, "featured": false}, {"code": "7CWQLP", "title": "Federated Open OnDemand", "abstract": "Some organizations, such as CSC - IT Center for Science, provide the users with access to multiple supercomputers, where each of the supercomputers may have completely separate instances of Open OnDemand. This leads to a fragmented user experience, where the user is required to log in to another instance to access another supercomputer, as well as increased time spent on maintaining multiple instances. This talk targets system administrators, service owners, and other persons responsible for maintaining and developing Open OnDemand instances, and discusses the benefits and challenges of providing a single instance of Open OnDemand, which is connected to all of the organization's supercomputers and potentially even partner organizations' supercomputers.", "speakers": ["TKYXWR"], "submission_type_id": 1, "track": 3, "start": "2025-03-18T15:30:00-04:00", "end": "2025-03-18T15:55:00-04:00", "room": 2, "featured": false}, {"code": "ZXPTGW", "title": "Creating and Deploying Singularity-Based Web Applications on Open OnDemand", "abstract": "This talk will describe the process of creating and deploying Singularity-based interactive applications on the Open OnDemand environment. Singularity containers offer a secure and portable way to package applications. When combined with Open OnDemand, they enable easy scaling of single-user applications to multi-user environments, while offloading user management to the Open OnDemand environment. The talk will also cover the used of Streamlit for the creation of python-based web applications that integrate with Open OnDemand’s job submission system and shared file systems. Attendees will gain hands-on experience in deploying reproducible, and easily accessible applications in a high-throughput computing environment.", "speakers": ["ZYBQ3V"], "submission_type_id": 1, "track": 2, "start": "2025-03-18T16:00:00-04:00", "end": "2025-03-18T16:25:00-04:00", "room": 1, "featured": false}, {"code": "BNEEB3", "title": "Scaling up OOD - a sysadmin's perspective", "abstract": "A walk-through of concrete issues and performance improvements\r\nwhich CSC has identified when approaching a scale of hundreds of concurrent\r\nusers on Open OnDemand. The aim is to inform system administrators and developers\r\nwho are operating an OOD instance about potential pitfalls, as well as quirks\r\nwhich only become visible at a larger scale.\r\n\r\nThis technical talk will consider site-specific issues, code-specific issues in the OOD\r\nupstream, as well as architectural impacts of using Passenger.\r\nA general understanding of the OOD architecture, Passenger's role in it, and\r\nLinux systems programming is beneficial.", "speakers": ["3NQDY7"], "submission_type_id": 1, "track": 3, "start": "2025-03-18T16:00:00-04:00", "end": "2025-03-18T16:25:00-04:00", "room": 2, "featured": false}, {"title": {"en": "OOD GOODLUCK Project"}, "start": "2025-03-18T20:30:00Z", "end": "2025-03-18T18:00:00-04:00", "room": 1}], "version": "0.1", "timezone": "US/Eastern", "tracks": [{"id": 1, "name": {"en": "Tutorial"}, "description": {}, "color": "#BD79FB"}, {"id": 2, "name": {"en": "Application Track"}, "description": {}, "color": "#DB6524"}, {"id": 3, "name": {"en": "Platform Track"}, "description": {}, "color": "#7A685B"}, {"id": 4, "name": {"en": "Platinum Sponsor Talk"}, "description": {}, "color": "#FF2172"}, {"id": 5, "name": {"en": "Core Team Track"}, "description": {}, "color": "#1AA6EA"}, {"id": 11, "name": {"en": "Application Track [featuring AI OnDemand]"}, "description": {}, "color": "#DB6524"}], "rooms": [{"id": 1, "name": {"en": "Tsai Auditorium (CGIS S010)"}, "description": {"en": "S010"}}, {"id": 2, "name": {"en": "Belfer Case Study Room (CGIS S020)"}, "description": {"en": "S020"}}], "speakers": [{"code": "UU9PCJ", "name": "Thomas Drake-Brockman [Perth Children's Hospital]", "avatar": null}, {"code": "UNTF39", "name": "Len Wisniewski [Harvard]", "avatar": null}, {"code": "NMMEVT", "name": "Emily Moffat Sadeghi [Ohio Supercomputer Center]", "avatar": null}, {"code": "LUTE9X", "name": "Johnathan Lee [Arizona State University]", "avatar": "https://cfp.openondemand.org/media/avatars/54415756_AiovgN2.png"}, {"code": "S8CX8K", "name": "Travis Ravert [Ohio Supercomputer Center]", "avatar": null}, {"code": "ZYBQ3V", "name": "Kyriakos Tsoukalas [Colgate University]", "avatar": null}, {"code": "MHPPMS", "name": "Huston Rogers [Mississippi State University]", "avatar": null}, {"code": "NK9DBW", "name": "Dean Anderson [Brigham Young University]", "avatar": "https://cfp.openondemand.org/media/avatars/bio_pic_W6ldysv.jpeg"}, {"code": "3NQDY7", "name": "Simon Westersund [CSC - IT Center for Science]", "avatar": null}, {"code": "MVBZY3", "name": "Harry Smallbone [University of Western Australia]", "avatar": null}, {"code": "DNNSNU", "name": "Edwin Berbesi [Queen's University]", "avatar": null}, {"code": "7HLYWH", "name": "Dori Sajdak [University at Buffalo]", "avatar": null}, {"code": "TKYXWR", "name": "Robin Karlsson [CSC - IT Center for Science]", "avatar": null}, {"code": "CXXGKD", "name": "Xavier Pillons [Microsoft]", "avatar": null}]}