{"talks": [{"code": "CFEMBK", "title": "Contributor Jam", "abstract": "What is the Contributor Jam? | The Contributor Jam will offer attendees an immersive opportunity to work closely with Open OnDemand (OOD) developers. Participants will gain an understanding of OOD's components and leave with the knowledge and tools to contribute to its development.", "speakers": ["NMMEVT", "S8CX8K"], "submission_type_id": 12, "track": 5, "start": "2025-03-17T13:00:00-04:00", "end": "2025-03-17T17:00:00-04:00", "room": 2, "featured": false}, {"code": "Z8XYSF", "title": "From 0 to OOD: How to install Open On Demand with Keycloak and Slurm integration.", "abstract": "This tutorial provides an introduction to how to install and configure Open On Demand, Slurm and Keycloak. Open OnDemand offers a user-friendly web interface for managing HPC resources, allowing users to submit jobs, access files, and utilize interactive applications easily. Slurm, a robust workload manager, is introduced for efficient job scheduling and resource allocation in HPC clusters. Keycloak, an open-source identity and access management solution, is integrated to enhance security through authentication and authorization. By following this tutorial, users will gain practical knowledge and skills to deploy a seamless and secure HPC environment on their own PCs.", "speakers": ["DNNSNU"], "submission_type_id": 7, "track": 1, "start": "2025-03-18T08:00:00-04:00", "end": "2025-03-18T09:30:00-04:00", "room": 2, "featured": false}, {"code": "TJNP7W", "title": "Integrating XDMoD with OnDemand", "abstract": "This tutorial will demonstrate how to integrate XDMoD job statistics graphics on the OnDemand dashboard and how to configure XDMoD to aggregate OnDemand usage logs.", "speakers": ["7HLYWH"], "submission_type_id": 7, "track": 1, "start": "2025-03-18T08:00:00-04:00", "end": "2025-03-18T09:30:00-04:00", "room": 1, "featured": false}, {"title": {"en": "Break"}, "start": "2025-03-18T13:30:00Z", "end": "2025-03-18T10:00:00-04:00", "room": 1}, {"code": "V3PHZJ", "title": "Extending Functionality with Initializers", "abstract": "OOD can leverage initializers to customize or provide extended options when generating forms, and using other OOD features. This talk covers what initializers are, how to set them up, and example initializers for different functions.", "speakers": ["MHPPMS"], "submission_type_id": 7, "track": 1, "start": "2025-03-18T10:00:00-04:00", "end": "2025-03-18T11:30:00-04:00", "room": 1, "featured": false}, {"code": "SWLTCA", "title": "Deploying a user-facing system status application with NextJS and OOD", "abstract": "A tutorial for getting a NextJS node status application set up with OOD.", "speakers": ["LUTE9X"], "submission_type_id": 7, "track": 1, "start": "2025-03-18T10:00:00-04:00", "end": "2025-03-18T11:30:00-04:00", "room": 2, "featured": false}, {"title": {"en": "Lunch"}, "start": "2025-03-18T15:30:00Z", "end": "2025-03-18T12:30:00-04:00", "room": 1}, {"code": "FK7R3E", "title": "A GOOD Start:  Open OnDemand’s Past, Present, and Future", "abstract": "The conference will kick-off with a welcome to everyone attending as well as a brief overview of recent major accomplishments related to Open OnDemand.  Open OnDemand PI Alan Chalker will provide a vision for the future of Open OnDemand, particularly as it relates to the rapid adoption of AI technologies.", "speakers": ["8MLMLZ"], "submission_type_id": 1, "track": 12, "start": "2025-03-18T12:30:00-04:00", "end": "2025-03-18T12:55:00-04:00", "room": 1, "featured": false}, {"code": "TPGRMP", "title": "Open OnDemand @ Harvard IQSS", "abstract": "This talk gives a high-level overview of our user-centered, collaborative approach to infrastructure operations and software development for Open OnDemand at Harvard IQSS.  We highlight past, present, and future projects for Open OnDemand feature development.  This talk can serve as a springboard for a number of other presentations as needed to share more in-depth experiences with Open OnDemand.", "speakers": ["UNTF39"], "submission_type_id": 1, "track": 4, "start": "2025-03-18T13:00:00-04:00", "end": "2025-03-18T13:25:00-04:00", "room": 1, "featured": false}, {"code": "AV3LRW", "title": "Maximizing your AI Infrastructure Utilization with Open OnDemand and GPU Fractionalization", "abstract": "The growing demands for accelerated computing in batch HPC and AI training call for innovative strategies to enhance infrastructure utilization. GPU fractionalization enables dynamic allocation and sharing of GPU resources, resulting in cost savings and improved efficiency. This talk will discuss key approaches, including NVIDIA Multi-Instance GPU (MIG) and JuiceLabs' dynamic GPU sharing software, highlighting their features, impact on system design, and interaction with the Open OnDemand ecosystem. We will also present a new initiative between Cambridge Computer and JuiceLabs to develop the integration of their GPU-sharing technology with Open OnDemand and discuss how institutions can start using the product today and contribute to the design and vision of the product.", "speakers": ["AVHKKM"], "submission_type_id": 1, "track": 14, "start": "2025-03-18T13:30:00-04:00", "end": "2025-03-18T13:55:00-04:00", "room": 1, "featured": false}, {"code": "SZXWKM", "title": "Bringing AI tools to Open OnDemand to boost coding efficiency", "abstract": "Integrating AI-powered developer tools within VS Code and Jupyter Notebooks significantly enhances coding efficiency and productivity. This presentation will feature select coding assistant tools applicable to Open OnDemand users engaged in coding, encompassing beginner developers, data analysts, and experienced developers. Participants will receive feature overviews and installation guidance to facilitate the seamless adoption of AI-powered coding tools.", "speakers": ["HDBJNV"], "submission_type_id": 1, "track": 11, "start": "2025-03-18T14:00:00-04:00", "end": "2025-03-18T14:25:00-04:00", "room": 1, "featured": false}, {"code": "KX33UB", "title": "Lessons Learned from 8 Years of Open OnDemand at Princeton Research Computing", "abstract": "Adopting a new software platform that has the power to change the way teaching and research is done is rarely easy. In this talk, we explain how Princeton University Research Computing started with Open OnDemand (OOD), what we contributed, and what we learned. Hear about our problems, solutions and continued pain points.", "speakers": ["PXTCFR", "RB7MVU", "7ZKSVJ"], "submission_type_id": 1, "track": 3, "start": "2025-03-18T14:00:00-04:00", "end": "2025-03-18T14:25:00-04:00", "room": 2, "featured": false}, {"code": "KGVZRX", "title": "Developer Forum (Breakout Sessions)", "abstract": "Room for optional breakout sessions", "speakers": [], "submission_type_id": 1, "track": 5, "start": "2025-03-18T14:30:00-04:00", "end": "2025-03-18T14:55:00-04:00", "room": 2, "featured": false}, {"code": "3CWD9A", "title": "Developer Forum (Breakout Sessions)", "abstract": "Room for optional breakout sessions", "speakers": [], "submission_type_id": 1, "track": 5, "start": "2025-03-18T14:30:00-04:00", "end": "2025-03-18T14:55:00-04:00", "room": 4, "featured": false}, {"code": "R7UZUH", "title": "Developer Forum (Breakout Sessions)", "abstract": "Room for optional breakout sessions", "speakers": [], "submission_type_id": 1, "track": 5, "start": "2025-03-18T14:30:00-04:00", "end": "2025-03-18T14:55:00-04:00", "room": 3, "featured": false}, {"title": {"en": "Break"}, "start": "2025-03-18T19:00:00Z", "end": "2025-03-18T15:30:00-04:00", "room": 1}, {"code": "7CWQLP", "title": "Federated Open OnDemand", "abstract": "Some organizations, such as CSC - IT Center for Science, provide the users with access to multiple supercomputers, where each of the supercomputers may have completely separate instances of Open OnDemand. This leads to a fragmented user experience, where the user is required to log in to another instance to access another supercomputer, as well as increased time spent on maintaining multiple instances. This talk targets system administrators, service owners, and other persons responsible for maintaining and developing Open OnDemand instances, and discusses the benefits and challenges of providing a single instance of Open OnDemand, which is connected to all of the organization's supercomputers and potentially even partner organizations' supercomputers.", "speakers": ["TKYXWR"], "submission_type_id": 1, "track": 3, "start": "2025-03-18T15:30:00-04:00", "end": "2025-03-18T15:55:00-04:00", "room": 2, "featured": false}, {"code": "ZHJDGC", "title": "Deploying LLM web applications on Open OnDemand: experiences at Perth Children's Hospital", "abstract": "Open OnDemand (OOD) is ideally placed to bridge the divide between traditional shell-based batch HPC and emerging large language model (LLM) workflows. Our team deployed OOD internally at MERLIN, a small HPC research cluster located inside Perth Children’s Hospital to provide HPC resources to a range of technical and non-technical users on sensitive healthcare data. We adapted existing LLM web applications for OOD to provide a low-code playground for non-technical researchers such as medical doctors and research assistants to engage with LLM resources in a healthcare environment. This presentation will discuss the rationale, and implementation of OOD LLM web applications in a highly restricted environment and motivate future improved support for these types of workflows within OOD.", "speakers": ["MVBZY3", "UU9PCJ"], "submission_type_id": 1, "track": 11, "start": "2025-03-18T15:30:00-04:00", "end": "2025-03-18T15:55:00-04:00", "room": 1, "featured": false}, {"code": "BNEEB3", "title": "Scaling up OOD - a sysadmin's perspective", "abstract": "A walk-through of concrete issues and performance improvements\r\nwhich CSC has identified when approaching a scale of hundreds of concurrent\r\nusers on Open OnDemand. The aim is to inform system administrators and developers\r\nwho are operating an OOD instance about potential pitfalls, as well as quirks\r\nwhich only become visible at a larger scale.\r\n\r\nThis technical talk will consider site-specific issues, code-specific issues in the OOD\r\nupstream, as well as architectural impacts of using Passenger.\r\nA general understanding of the OOD architecture, Passenger's role in it, and\r\nLinux systems programming is beneficial.", "speakers": ["3NQDY7"], "submission_type_id": 1, "track": 3, "start": "2025-03-18T16:00:00-04:00", "end": "2025-03-18T16:25:00-04:00", "room": 2, "featured": false}, {"code": "ZXPTGW", "title": "Creating and Deploying Singularity-Based Web Applications on Open OnDemand", "abstract": "This talk will describe the process of creating and deploying Singularity-based interactive applications on the Open OnDemand environment. Singularity containers offer a secure and portable way to package applications. When combined with Open OnDemand, they enable easy scaling of single-user applications to multi-user environments, while offloading user management to the Open OnDemand environment. The talk will also cover the used of Streamlit for the creation of python-based web applications that integrate with Open OnDemand’s job submission system and shared file systems. Attendees will gain hands-on experience in deploying reproducible, and easily accessible applications in a high-throughput computing environment.", "speakers": ["ZYBQ3V"], "submission_type_id": 1, "track": 2, "start": "2025-03-18T16:00:00-04:00", "end": "2025-03-18T16:25:00-04:00", "room": 1, "featured": false}, {"code": "XUTHP9", "title": "Growing Open OnDemand: Leveraging Unified Community Knowledge (GOODLUCK) – A Deeper Dive", "abstract": "Members of the leadership team of GOODLUCK, the most recent NSF-funded Open OnDemand project, will introduce the key elements of the four major thrusts of the project:  building an apverse, gathering classroom solutions,  developing cross-cutting solutions and growing the community through affinity groups with time for Q&A and feedback. \r\n\r\nThis session will be followed by the Idea Marketplace, where audience members will have an opportunity to have informal one-on-one discussions with the GOODLUCK team to provide feedback and join the effort.", "speakers": [], "submission_type_id": 11, "track": 12, "start": "2025-03-18T16:30:00-04:00", "end": "2025-03-18T18:00:00-04:00", "room": 1, "featured": false}, {"code": "M8TV3T", "title": "Idea Marketplace and Reception (Hors D'oeuvres)", "abstract": "Join us for an evening of posters, GOODLUCK conversations, and some fun and games. \r\n\r\nChat with our sponsors, meet fellow GOOD attendees and the Open OnDemand core team, and gear up for Day 3! \r\n\r\nDrinks and refreshments will be served!", "speakers": [], "submission_type_id": 13, "track": 7, "start": "2025-03-18T18:00:00-04:00", "end": "2025-03-18T20:00:00-04:00", "room": 5, "featured": false}, {"code": "3PW9AL", "title": "Using OpenOnDemand for Real-World, Interdisciplinary AI Projects in Classrooms", "abstract": "Integrating interdisciplinary collaboration in AI courses enables students to apply AI to real-world problems across diverse fields. In my AI classes, students partner with faculty from various departments, using OpenOnDemand for GPU-based computations to develop AI solutions. This hands-on approach includes projects like rainfall prediction, wildlife imagery classification, and healthcare trend analysis. OpenOnDemand supports these projects enabling students to tackle data-intensive challenges. This framework builds technical skills and highlights AI’s impact across disciplines, preparing students to innovate beyond traditional boundaries. This poster showcases the work done with OpenOnDemand across 7 different disciplines to show the interdisciplinary power of OpenOnDemand.", "speakers": ["LTACCL"], "submission_type_id": 10, "track": 13, "start": "2025-03-18T18:30:00-04:00", "end": "2025-03-18T18:40:00-04:00", "room": 5, "featured": false}, {"code": "FU7YFW", "title": "Simplifying HPC Access: Enhancing Research with Open OnDemand at University of Virginia", "abstract": "As computational methods in research evolve, many researchers face challenges using traditional High-Performance Computing (HPC) systems. At the University of Virginia Research Computing, we address this by leveraging Open OnDemand (OOD) as a user-friendly, browser-based platform for Interactive HPC (IHPC) and Slurm job management. OOD simplifies HPC access with popular applications, virtual desktops for GUI-based tools, and seamless connectivity without the need for a VPN or command-line interaction. To enhance usability, we’ve added custom utilities for monitoring account status, managing scratch filesystem files, and generating Slurm scripts with Service Unit (SU) estimates. \r\nThese innovations reduce barriers to HPC use, enabling researchers to focus on their work while accessing pow", "speakers": ["KLCLLE"], "submission_type_id": 10, "track": 9, "start": "2025-03-18T18:40:00-04:00", "end": "2025-03-18T18:50:00-04:00", "room": 5, "featured": false}, {"code": "PJMNB7", "title": "The OOD App Ecosystem", "abstract": "There are thousands of scientific and HPC applications that users need to carry out their work. OOD offers an incredible resource for users to access these applications, but how best to understand the existing OOD Apps, to learn from them, and to create your own? In this poster, we propose a simple, centralized repository for OOD Apps and some basic guidelines for creating and sharing new ones.", "speakers": ["KPMTKJ"], "submission_type_id": 10, "track": 9, "start": "2025-03-18T18:50:00-04:00", "end": "2025-03-18T19:00:00-04:00", "room": 5, "featured": false}, {"code": "99AZDY", "title": "Dartmouth College Open OnDemand Setup", "abstract": "How we worked through the Kerberized NFS storage", "speakers": ["J8PCFK"], "submission_type_id": 10, "track": 9, "start": "2025-03-18T19:00:00-04:00", "end": "2025-03-18T19:10:00-04:00", "room": 5, "featured": false}, {"code": "EJ9LEA", "title": "Open OnDemand Developer Relations", "abstract": "Learn how the Open OnDemand Dev team organizes the github issues that drive the development and release process and how to contribute to the project.", "speakers": ["NMMEVT"], "submission_type_id": 1, "track": 5, "start": "2025-03-19T09:00:00-04:00", "end": "2025-03-19T09:25:00-04:00", "room": 1, "featured": false}, {"code": "BX7BCF", "title": "OOD Meets EESSI: Accessing and  Distributing Scientific Software with Ease", "abstract": "This presentation will provide an overview of the EESSI project and its objectives, as well as our plans to integrate it into the OOD platform. This will allow for combined easy access to both scientific software and HPC resources in a single platform.", "speakers": ["QQTEM8", "CY7CL3"], "submission_type_id": 1, "track": 4, "start": "2025-03-19T09:30:00-04:00", "end": "2025-03-19T09:55:00-04:00", "room": 1, "featured": false}, {"code": "UAU9AG", "title": "Integrating MATLAB with OOD: New Tools to Boost Usage and Improve User Experience", "abstract": "Join us to learn how HPC Centers and other sites are integrating MATLAB to work with cluster hardware and data portals. This session will cover tools and best practices to make MATLAB available to users on OOD as a browser-based app and as a Jupyter Notebook language plug-in, as well as available GPU and other parallel computing capabilities.", "speakers": ["M7K9BW", "KPFWQA"], "submission_type_id": 1, "track": 8, "start": "2025-03-19T10:00:00-04:00", "end": "2025-03-19T10:25:00-04:00", "room": 1, "featured": false}, {"code": "QGHTR3", "title": "AWS", "abstract": "TBA", "speakers": [], "submission_type_id": 1, "track": 8, "start": "2025-03-19T10:00:00-04:00", "end": "2025-03-19T10:25:00-04:00", "room": 2, "featured": false}, {"title": {"en": "Break"}, "start": "2025-03-19T14:30:00Z", "end": "2025-03-19T11:00:00-04:00", "room": 1}, {"code": "WQFEUA", "title": "Microsoft Windows through OOD: easy, fast, secure, and scalable", "abstract": "Not all commercially available software will run on Linux or Wine, compelling researchers to request Windows in HPC environments. Traditional solutions demand dedicated servers, Active Directory infrastructure, and specialized IT staff. 7lbd (7-layer bean dip) is an open-source project that eliminates this overhead by treating Windows as \"just another Open OnDemand application,\" allowing users to launch secure Windows desktops in an isolated environment anywhere on their cluster while maintaining access to all of the user’s files. This solution simplifies Windows to a level that even Linux systems administrators will find easy to maintain.", "speakers": ["NK9DBW"], "submission_type_id": 1, "track": 2, "start": "2025-03-19T11:00:00-04:00", "end": "2025-03-19T11:25:00-04:00", "room": 1, "featured": false}, {"code": "PUWKRB", "title": "Fungible Slurm clusters with Open OnDemand and Azure CycleCloud", "abstract": "Learn how to build on-demand Slurm clusters using the Azure CycleCloud workspace for Slurm and extend it with an Open OnDemand portal connected to Slurm. This talk will provide you with technical know-how and practical insights to efficiently leverage these tools, ensuring your Azure computational resources are both scalable and flexible.", "speakers": ["CXXGKD"], "submission_type_id": 1, "track": 3, "start": "2025-03-19T11:00:00-04:00", "end": "2025-03-19T11:25:00-04:00", "room": 2, "featured": false}, {"code": "RRETPP", "title": "Reinventing OOD Proxying: Mutual TLS Auth, Access Control, and VNC/RDP to the Desktop", "abstract": "Discover how to securely connect desktop applications directly to Open OnDemand jobs using mutual TLS authentication all the way from desktop client to compute node. This technical presentation demonstrates a new proxy architecture enabling RDP, VNC, and other protocols to connect securely from desktop client programs to applications on compute nodes, with enhanced security controls missing from the current proxy implementation. It’s perfect for sites wanting to offer desktop client access while maintaining browser viewer capabilities, all with improved security.", "speakers": ["LX93PT"], "submission_type_id": 1, "track": 2, "start": "2025-03-19T11:30:00-04:00", "end": "2025-03-19T11:55:00-04:00", "room": 1, "featured": false}, {"code": "9P3FWH", "title": "Software Defined HPC with Open OnDemand", "abstract": "Research computing organizations facilitate scientific investigations by providing access to computational resources, advanced networking, and ample storage to support the demands of scientific workflows.  Traditional HPC systems run as self-contained environments with a head node that defines access to all resources and orchestrates operation of the cluster.  Managing access to these services over the various lifetimes of hardware, software, clusters, and facilities presents challenges in maintaining access for users to different systems as they evolve.  At UAB we are building a software defined HPC environment to manage evolution of our systems by implementing an A/B testing framework that leverages Open OnDemand as the web interface to different generations of hardware.", "speakers": ["MNGM9P"], "submission_type_id": 1, "track": 3, "start": "2025-03-19T11:30:00-04:00", "end": "2025-03-19T11:55:00-04:00", "room": 2, "featured": false}, {"title": {"en": "Lunch"}, "start": "2025-03-19T16:00:00Z", "end": "2025-03-19T13:00:00-04:00", "room": 1}, {"code": "AAGZE9", "title": "Using OpenOnDemand for Teaching", "abstract": "This BoF will bring together administrators from different institutions who use OOD in a teaching context. We will have a panel of presenters to talk about how OOD is implemented for teaching in their implementation, and then open up the floor for discussion with the panel. This BoF is intended to be useful to developers and administrators who are responsible for OOD in teaching use cases, as well as instructors who want a better understanding of what's going on behind the scenes with the platforms they use. It's our hope that this sharing of ideas will result in a lot of learning from different solutions to similar problems unique to deploying OOD for teaching.", "speakers": ["CYAMNS", "RKGAEH", "KPMTKJ", "7UPGTS"], "submission_type_id": 9, "track": 6, "start": "2025-03-19T13:00:00-04:00", "end": "2025-03-19T14:30:00-04:00", "room": 3, "featured": false}, {"code": "ARPPAF", "title": "Containerized Open OnDemand Base", "abstract": "A comprehensive overview of taking a base container setup, building of the image and standing up of ood in a container.", "speakers": ["BZPBWJ"], "submission_type_id": 9, "track": 6, "start": "2025-03-19T13:00:00-04:00", "end": "2025-03-19T14:30:00-04:00", "room": 2, "featured": false}, {"code": "C7N9RV", "title": "HPC Adult Coloring Book BOF", "abstract": "Ever heard of coloring books for adults? Take a brain break, hang out with new friends and colleagues and color the \"What's So Super About Super Computing?\" OSC coloring book. Colored pencils provided!", "speakers": ["LEJNUU"], "submission_type_id": 9, "track": 6, "start": "2025-03-19T13:00:00-04:00", "end": "2025-03-19T14:30:00-04:00", "room": 4, "featured": false}, {"code": "TTWN9E", "title": "Bridging the Gap: Simplifying HPC Access for Data Science Users at Universidad de Sonora", "abstract": "The Universidad de Sonora (UNISON) has successfully integrated Open OnDemand to address the growing demand for high-performance computing (HPC) resources among researchers and students, particularly those in data science with limited technical expertise in HPC. This presentation will showcase how Open OnDemand has empowered non-specialized users by providing an intuitive interface to access advanced computational resources, enabling breakthroughs in data-driven research. By detailing our implementation strategy, user-focused approach, and the resulting benefits, we aim to highlight the transformative potential of Open OnDemand for institutions facing similar challenges.", "speakers": ["CXPR3P"], "submission_type_id": 1, "track": 3, "start": "2025-03-19T14:30:00-04:00", "end": "2025-03-19T14:55:00-04:00", "room": 2, "featured": false}, {"code": "73MZUC", "title": "Containerized bioinformatics applications and pipelines on Open OnDemand", "abstract": "Tufts University hosts a vibrant bioinformatics community, many of whom are new to using the linux command line for high-performance computing (HPC). Open OnDemand (OOD) simplifies access to HPC resources with its user-friendly web interface. At Tufts, we have deployed over 30 bioinformatics applications and nf-core pipelines on OOD, including custom RStudio servers tailored for bioinformatics. The nf-core pipelines enable users to run complex workflows with ease. Here, we share our experiences in building a custom RStudio server container for bioinformatics, deploying containerized applications as OOD apps, and transforming the complex command-line interfaces of nf-core pipelines into user-friendly OOD web applications.", "speakers": ["MPPTM8"], "submission_type_id": 1, "track": 2, "start": "2025-03-19T14:30:00-04:00", "end": "2025-03-19T14:55:00-04:00", "room": 1, "featured": false}, {"code": "NKEYVY", "title": "ERN CryoEM Federated Remote Instrument Access Pilot Project", "abstract": "The Ecosystem for Research Networking (ERN) CryoEM Remote Instrument Access Pilot Project aims to simplify wide-area internet access to scientific instruments and data sets by multi-institutional collaboration with emphasis on under-represented and under-resourced institutions. The goal is a secure, web-based portal, built upon containerized Open OnDemand, providing federated access to scientific instruments and associated large data sets;  generate workflows paired with AI microservices, edge computing, and advanced computing, for real-time experimental parameter adjustments and decisions. This talk will present an overview of the design and development efforts of this active project, concluding with a short video and link to the open-source GitHub repository for community participation.", "speakers": ["LNWEAV"], "submission_type_id": 1, "track": 3, "start": "2025-03-19T15:00:00-04:00", "end": "2025-03-19T15:25:00-04:00", "room": 2, "featured": false}, {"code": "SUZHBH", "title": "Using Community Container Images with OOD for Robust RStudio Server and PostGIS", "abstract": "We present our experience of leveraging several publicly available container projects for RStudio Server and PostGIS/PostgreSQL Open OnDemand interactive apps. These containers have pre-configured software stacks that facilitate easier application-specific package installation by users, reducing user support requests on computing center staff. This talk describes the user-friendly OOD interfaces to these complex apps and how the containers are launched on an HPC cluster with Singularity.", "speakers": ["STL7KR"], "submission_type_id": 1, "track": 2, "start": "2025-03-19T15:00:00-04:00", "end": "2025-03-19T15:25:00-04:00", "room": 1, "featured": false}, {"title": {"en": "Break"}, "start": "2025-03-19T19:30:00Z", "end": "2025-03-19T16:00:00-04:00", "room": 1}, {"code": "MYXNRF", "title": "OOD at IFOM: combining Cancer Research, reproducibility and user-friendliness", "abstract": "IFOM is a cancer biomedical research center, with the ultimate goal of translating the discoveries in treatments and prevention strategies. Democratizing the access to the computational resources is the key step for our biomedical researchers to be independent in analyzing and exploring the data; for bioinformaticians to deliver novel computational approaches with ease; for the organization to have an organic, scalable and sustainable platform. This talk walkthrough on IFOM’s adoption of Open OnDemand: the challenges, the solutions and the cultural implications of this technological integration.", "speakers": ["RQFDCB", "FPVFN8"], "submission_type_id": 1, "track": 3, "start": "2025-03-19T16:00:00-04:00", "end": "2025-03-19T16:25:00-04:00", "room": 2, "featured": false}, {"code": "NYHCQF", "title": "AlphaFold accessibility: an optimized open-source OOD app for Protein Structure Prediction", "abstract": "The AlphaFold AI system won the 2024 Chemistry Nobel Prize because of its predictive achievements poised to revolutionize disease understanding and drug discovery. Initially released as open-source (and now proprietary), researchers are working to improve the code to require less resources and maintain open-source accessibility. We present an open-source implementation of AlphaFold 2 & 3 that optimizes computational resource allocation by intelligently separating CPU and GPU phases within a single OOD instance. This addresses a critical challenge to make AlphaFold more accessible by minimizing idle GPU cycles. Benchmarking across three major clusters (NCSA Delta, Jetstream2, and ROAR), we developed a user-friendly OOD application that operates with maximum resource efficiency.", "speakers": ["EU7H8E", "JX7ZVY"], "submission_type_id": 1, "track": 11, "start": "2025-03-19T16:00:00-04:00", "end": "2025-03-19T16:25:00-04:00", "room": 1, "featured": false}, {"code": "3R7NWE", "title": "Try | Create | Share - Customizations with OnDemand plugins", "abstract": "Open OnDemand has evolved to offer powerful customization features, enabling institutions to tailor their instances like never before. This talk will explore how these features allow administrators and developers to create and deploy customizations easily, fostering a community-driven ecosystem of shared enhancements. Attendees will learn how to extend Open OnDemand using plugins and benefit from community contributions through practical examples, such as the metrics widget and the session card metrics developed by IQSS.\r\n\r\nWhether you're managing an HPC environment or developing for Open OnDemand, you'll leave with practical knowledge on how to try, create, and share customizations that simplify administration and improve user experiences.", "speakers": ["LGFWCA"], "submission_type_id": 1, "track": 2, "start": "2025-03-19T16:30:00-04:00", "end": "2025-03-19T16:55:00-04:00", "room": 1, "featured": false}, {"code": "D8UEDS", "title": "OOD from Scratch: if we can do it, so can you!", "abstract": "Open OnDemand (OOD) is a transformative tool for Research and High Performance Computing Centers -- but getting it up-and-running at your institution can feel daunting. We recently took on this challenge, and trust me, if one guy from a small team at a small school can do it, then so can you! I will talk about excellent resources I had, lessons I learned, and some key takeaways from the experience. If you are considering OOD for your institution, then this is your chance to hear some positive first-hand experience.", "speakers": ["KPMTKJ"], "submission_type_id": 1, "track": 3, "start": "2025-03-19T16:30:00-04:00", "end": "2025-03-19T16:55:00-04:00", "room": 2, "featured": false}, {"code": "78P3VV", "title": "Open OnDemand App Template for Standardizing and Simplifying Development", "abstract": "The OnDemand Template is a framework that simplifies and standardizes the app development process, which aims to reduce the learning curve for new developers. It offers a documented, generic application that provides most of the configuration required to get applications running in the OnDemand system. Users can specify parameters via the form file, which the template will utilize to self-configure. In most cases, users only need to specify the app metadata, modules to load, the command to execute, and whether it's VNC enabled. The template also utilizes a work in progress plugin system that allows developers to extend existing apps by dynamically adding attributes to the form file and evaluating scripts before the app is started, which allows for apps to be easily extended.", "speakers": ["F98XHJ"], "submission_type_id": 3, "track": 2, "start": "2025-03-19T17:00:00-04:00", "end": "2025-03-19T17:10:00-04:00", "room": 1, "featured": false}, {"code": "T8TCDS", "title": "Building Success Through Testing", "abstract": "Rolling out Open OnDemand is one thing - ensuring it actually works for users is another. Without a structured testing strategy, unexpected issues can slip through, leading to frustrated researchers and overloaded support teams.", "speakers": ["M333SN"], "submission_type_id": 3, "track": 3, "start": "2025-03-19T17:00:00-04:00", "end": "2025-03-19T17:10:00-04:00", "room": 2, "featured": false}, {"code": "EZSRZ8", "title": "SAML Authentication with Open On Demand for HPC Clusters", "abstract": "Secure and efficient access to High-Performance Computing (HPC) resources is critical for enabling scientific and technical innovation. Open OnDemand (OOD), a widely used web-based HPC access portal, simplifies user interactions with cluster resources. However, traditional authentication methods often present challenges, including limited scalability, complex configurations, and security vulnerabilities. Integrating Security Assertion Markup Language (SAML)-based authentication with OOD addresses these challenges by leveraging federated identity providers for seamless and secure single sign-on (SSO). This approach enables researchers and institutions to utilize existing identity management systems, ensuring compliance with organizational policies while streamlining user access. The present", "speakers": ["WPF3NV"], "submission_type_id": 3, "track": 2, "start": "2025-03-19T17:10:00-04:00", "end": "2025-03-19T17:20:00-04:00", "room": 1, "featured": false}, {"code": "GY9Y7X", "title": "Open OnDemand for an Established University HPC Community", "abstract": "The Advanced Research Computing department at the University of British Columbia (UBC) have been supporting a local HPC cluster for use by the entire UBC research community for nearly a decade. With a demand for more interactive computing options coming from our researchers, we have begun implementing Open OnDemand as a portal for accessing our resources and with that has come challenges around our currently existing architecture. This talk will provide a detailed, yet high-level overview of the challenges we faced and the solutions we explored. By sharing our journey, we hope to provide other system administrators with a view of both the ease of modifying Open OnDemand for current systems, as well as potential challenges to keep in mind when exploring adding Open OnDemand.", "speakers": ["LPKMRG"], "submission_type_id": 3, "track": 3, "start": "2025-03-19T17:10:00-04:00", "end": "2025-03-19T17:20:00-04:00", "room": 2, "featured": false}, {"code": "ES9ML9", "title": "Integration of Open OnDemand with the Jobstats Job Monitoring Platform", "abstract": "Given the ever increasing cost of compute (especially GPUs) it is imperative that these resources are used efficiently. How can this be achieved in a simple-to-use way on a high-performance computing cluster that supports a large number of diverse researchers? Our solution is Jobstats, a job monitoring platform which integrates with Open OnDemand (OOD). This talk will provide an overview of the platform and its various components while concentrating on its links with OOD. Our planned extensions for the OOD integration will be presented with the hope of receiving feedback and new ideas from attendees.", "speakers": ["PXTCFR", "RB7MVU"], "submission_type_id": 3, "track": 2, "start": "2025-03-19T17:20:00-04:00", "end": "2025-03-19T17:30:00-04:00", "room": 1, "featured": false}, {"code": "TGUZM9", "title": "Managing the software environment for a classroom deployment of OOD", "abstract": "The Ohio Supercomputer Center (OSC) saw increased use of its OSC OnDemand web interface for classroom applications during the COVID-19 pandemic, particularly for R and Python. To address challenges in creating shareable and reproducible environments, OSC customized RStudio and Jupyter Notebooks for a dedicated classroom OOD instance. This setup allows instructors to manage and configure software environments for students, ensuring consistency and reducing setup time. Instructors can also access student workspaces to review and manage homework.", "speakers": ["RBFG3Y"], "submission_type_id": 1, "track": 12, "start": "2025-03-19T17:30:00-04:00", "end": "2025-03-19T17:55:00-04:00", "room": 1, "featured": false}, {"code": "GUHH3G", "title": "Developer Forum (Breakout Sessions)", "abstract": "Meet with Open OnDemand Dev team members to ask questions about the platform and the docs that don’t easily lend themselves to discourse or email. Community members are welcome to chime in on topics outside the scope of what is deployed at Ohio Supercomputer Center.", "speakers": [], "submission_type_id": 1, "track": 5, "start": "2025-03-19T17:30:00-04:00", "end": "2025-03-19T17:55:00-04:00", "room": 4, "featured": false}, {"code": "UEWB9L", "title": "Developer Forum (Breakout Sessions)", "abstract": "Meet with Open OnDemand Dev team members to ask questions about the platform and the docs that don’t easily lend themselves to discourse or email. Community members are welcome to chime in on topics outside the scope of what is deployed at Ohio Supercomputer Center.", "speakers": [], "submission_type_id": 1, "track": 5, "start": "2025-03-19T17:30:00-04:00", "end": "2025-03-19T17:55:00-04:00", "room": 3, "featured": false}, {"code": "FBJKT8", "title": "Developer Forum", "abstract": "Meet with Open OnDemand Dev team members to ask questions about the platform and the docs that don’t easily lend themselves to discourse or email. Community members are welcome to chime in on topics outside the scope of what is deployed at Ohio Supercomputer Center.", "speakers": ["WHL8BQ", "8MLMLZ", "NMMEVT", "ZGCMS8", "S8CX8K"], "submission_type_id": 1, "track": 5, "start": "2025-03-19T17:30:00-04:00", "end": "2025-03-19T17:55:00-04:00", "room": 2, "featured": false}, {"code": "YGCSXM", "title": "Attendee Social at Fenway Park", "abstract": "📍 Location: Fenway Park\r\n🕕 Time: Wednesday, 6:00 PM – 9:30 PM", "speakers": [], "submission_type_id": 13, "track": 7, "start": "2025-03-19T18:00:00-04:00", "end": "2025-03-19T21:30:00-04:00", "room": 1, "featured": false}, {"code": "7TZZYC", "title": "Open OnDemand Governance & Sustainability", "abstract": "Learn about the Open OnDemand Governance and Sustainability models that we are rolling out in 2025 and how to get involved.", "speakers": ["ZGCMS8", "XN8CCP"], "submission_type_id": 1, "track": 5, "start": "2025-03-20T09:00:00-04:00", "end": "2025-03-20T09:25:00-04:00", "room": 1, "featured": false}, {"code": "GKLZKD", "title": "Dell and Intel AI Better Together", "abstract": "Join us to learn what Dell and Intel are doing in the evolving world of AI and HPC.  We will introduce the room to new platforms, new technology and the focused insights of Dell and Intel.", "speakers": ["BSWDGH", "HEWF73"], "submission_type_id": 1, "track": 14, "start": "2025-03-20T09:30:00-04:00", "end": "2025-03-20T09:55:00-04:00", "room": 1, "featured": false}, {"code": "RNBTC8", "title": "A Simplified Approach to Managing Your Data With Globus", "abstract": "Open OnDemand and Globus are natural partners: Open OnDemand lowers the barrier to using advanced computing resources while Globus removes the friction from data management. Using Globus to move and share data makes your Open OnDemand system even more valuable to researchers. In this talk we will demonstrate how the two systems integrate to help researchers reach data management and computation nirvana.", "speakers": ["Z8VTYR"], "submission_type_id": 1, "track": 8, "start": "2025-03-20T10:00:00-04:00", "end": "2025-03-20T10:25:00-04:00", "room": 1, "featured": false}, {"code": "ZLW9EY", "title": "Enhanced HPC Workforce Development: Overcoming the 'Blinking Cursor' Barrier with Open OnD", "abstract": "High-Performance Computing (HPC) workforce development initiatives aimed to train diverse stakeholders in essential tools and methods. The \"blinking cursor\" barrier in terminal interfaces was addressed by integrating Open OnDemand within the projectEUREKA platform, facilitating 18 groups of MSI undergraduates and faculty in cyberinfrastructure-targeted hackathons. These time-bounded events, based on the HackHPC Model, addressed the HPC skills gap through intensive applied training. This presentation will compare traditional terminal/CLI-based and web-GUI-based training approaches, examining their evolution and effectiveness. Additionally, modified outcomes and artifacts produced by participants will provide insights into the impact of these training methodologies.", "speakers": ["VQJFCA"], "submission_type_id": 1, "track": 8, "start": "2025-03-20T10:00:00-04:00", "end": "2025-03-20T10:25:00-04:00", "room": 2, "featured": false}, {"code": "WXPYBE", "title": "Developer Forum (Breakout Session)", "abstract": "Meet with Open OnDemand Dev team members to ask questions about the platform and the docs that don’t easily lend themselves to discourse or email. Community members are welcome to chime in on topics outside the scope of what is deployed at Ohio Supercomputer Center.", "speakers": [], "submission_type_id": 1, "track": 5, "start": "2025-03-20T10:30:00-04:00", "end": "2025-03-20T10:55:00-04:00", "room": 3, "featured": false}, {"code": "MH8ND3", "title": "Developer Forum", "abstract": "Meet with Open OnDemand Dev team members to ask questions about the platform and the docs that don’t easily lend themselves to discourse or email. Community members are welcome to chime in on topics outside the scope of what is deployed at Ohio Supercomputer Center.", "speakers": ["NMMEVT", "8MLMLZ", "WHL8BQ", "S8CX8K", "ZGCMS8"], "submission_type_id": 1, "track": 5, "start": "2025-03-20T10:30:00-04:00", "end": "2025-03-20T10:55:00-04:00", "room": 2, "featured": false}, {"code": "GLJQGC", "title": "Developer Forum (Breakout Session)", "abstract": "Meet with Open OnDemand Dev team members to ask questions about the platform and the docs that don’t easily lend themselves to discourse or email. Community members are welcome to chime in on topics outside the scope of what is deployed at Ohio Supercomputer Center.", "speakers": [], "submission_type_id": 1, "track": 5, "start": "2025-03-20T10:30:00-04:00", "end": "2025-03-20T10:55:00-04:00", "room": 4, "featured": false}, {"title": {"en": "Break"}, "start": "2025-03-20T15:00:00Z", "end": "2025-03-20T11:30:00-04:00", "room": 1}, {"code": "M3EWSU", "title": "Using a Passenger App for Displaying GPU Node Configuration and Resource Availability", "abstract": "An up-to-the-minute status report of the configuration and availability of HPC resources can be useful for selecting resource parameters in interactive apps. GPU node resources can be low at times leaving few or no GPUs available for immediate use when launching interactive apps. By providing the status of readily available GPU node resources such as the type and number of GPUs, CPU cores and GB of memory, users can more efficiently utilize cluster resources and minimize job queue wait times.", "speakers": ["RNEZP8"], "submission_type_id": 3, "track": 2, "start": "2025-03-20T11:30:00-04:00", "end": "2025-03-20T11:40:00-04:00", "room": 1, "featured": false}, {"code": "RARKPZ", "title": "Maintaining Institutional Identity Within a Shared Open OnDemand Instance", "abstract": "This session discusses using CILogon and Open OnDemand to enable institution-specific authentication and branding for Swarthmore College's and Lafayette College's merged HPC cluster.", "speakers": ["FMJYUA"], "submission_type_id": 3, "track": 3, "start": "2025-03-20T11:30:00-04:00", "end": "2025-03-20T11:40:00-04:00", "room": 2, "featured": false}, {"code": "PBSAAB", "title": "Open OnDemand Web Dashboard for User-Friendly Job Accounting and Performance Metrics", "abstract": "The Anvil supercomputer, funded by the NSF and maintained by Purdue University, powers research across the country. Anvil’s web dashboard is an Open OnDemand portal with just the base features, including creating jobs and viewing the job queue. However, a lot of information is locked behind Slurm terminal commands and other scripts, making it difficult for researchers without terminal knowledge to access the information provided by these commands. The goal of this project is to create a detailed, user-friendly dashboard built off of Open OnDemand to provide useful information about the cluster and their own jobs. This improved dashboard enables researchers to more efficiently conduct their research and access commonly-needed cluster information without learning complex terminal commands.", "speakers": ["W338JT"], "submission_type_id": 3, "track": 2, "start": "2025-03-20T11:45:00-04:00", "end": "2025-03-20T11:55:00-04:00", "room": 1, "featured": false}, {"code": "CXWBEP", "title": "Approachable High Performance Computing with Open OnDemand", "abstract": "Administrators and Research Consultants helping researchers scale their work can use Open OnDemand applications to make HPC resources more accessible to disciplines that are not traditionally identified as HPC users.  A brief discussion of how we help make high performance computing (HPC) more approachable to new users, with an emphasis on the applications presented, support process, and using Open OnDemand as a launch pad to fully integrate new users into the HPC workflow.", "speakers": ["NTHXT8"], "submission_type_id": 3, "track": 3, "start": "2025-03-20T11:45:00-04:00", "end": "2025-03-20T11:55:00-04:00", "room": 2, "featured": false}, {"code": "LNMCUB", "title": "Leveraging the Open Science Operating System to build virtual environments for science and education", "abstract": "The Stack Science team will share use cases to demonstrate how the Open Science Operating System (OS2) is driving research and scientific outcomes through a suite of capabilities, including science gateways as a service, research software development, secure cloud enclaves, and regulatory data management.", "speakers": ["EMVUF9", "SN7WZJ"], "submission_type_id": 1, "track": 8, "start": "2025-03-20T12:00:00-04:00", "end": "2025-03-20T12:25:00-04:00", "room": 2, "featured": false}, {"code": "8XZYTX", "title": "Drona Workflow Engine", "abstract": "Texas  A&M has a long history of creating Apps for OpenOnDemand to improve the user experience. In this presentation, we will present two of our latest projects. We will briefly show our new experimental customizable dashboard, where users can manage their resources and interact with the HPRC helpdesk. Next, we will show the Drona workflow engine, a framework for composing and generating custom workflows. Drona abstracts the researcher as much as possible from HPC specifics normally required to run their jobs on our clusters so they can focus on their research. This includes setting up custom environments and automatically selecting resources. A major application is to assist researchers in creating and running their AI workloads on a variety of accelerators.", "speakers": ["ESGDLM"], "submission_type_id": 1, "track": 5, "start": "2025-03-20T12:00:00-04:00", "end": "2025-03-20T12:25:00-04:00", "room": 1, "featured": false}, {"title": {"en": "Lunch/Contributor Jam Recognition"}, "start": "2025-03-20T16:30:00Z", "end": "2025-03-20T13:30:00-04:00", "room": 1}, {"code": "Y7E77C", "title": "A GOOD Ending", "abstract": "A brief summary of the GOOD conference will be provided, along with a call to action to continue the engagement within the Open OnDemand community in the months and years to come.", "speakers": ["8MLMLZ"], "submission_type_id": 1, "track": 5, "start": "2025-03-20T13:30:00-04:00", "end": "2025-03-20T13:55:00-04:00", "room": 1, "featured": false}, {"code": "8QYEUJ", "title": "Governance Working Group - Contributor Guide", "abstract": "TBA", "speakers": [], "submission_type_id": 11, "track": 5, "start": "2025-03-20T14:00:00-04:00", "end": "2025-03-20T15:00:00-04:00", "room": 3, "featured": false}, {"code": "E893EN", "title": "Governance Working Group - Technical", "abstract": "TBA", "speakers": [], "submission_type_id": 11, "track": 5, "start": "2025-03-20T14:00:00-04:00", "end": "2025-03-20T15:00:00-04:00", "room": 2, "featured": false}, {"code": "VP83KJ", "title": "Governance Working Group - Community Engagement", "abstract": "TBA", "speakers": [], "submission_type_id": 11, "track": 5, "start": "2025-03-20T14:00:00-04:00", "end": "2025-03-20T15:00:00-04:00", "room": 1, "featured": false}, {"code": "RPVAEC", "title": "Governance Working Group - User Guide", "abstract": "TBA", "speakers": [], "submission_type_id": 11, "track": 5, "start": "2025-03-20T14:00:00-04:00", "end": "2025-03-20T15:00:00-04:00", "room": 4, "featured": false}], "version": "0.23", "timezone": "US/Eastern", "tracks": [{"id": 1, "name": {"en": "Tutorial"}, "description": {}, "color": "#BD79FB"}, {"id": 2, "name": {"en": "Application Track"}, "description": {}, "color": "#DB6524"}, {"id": 3, "name": {"en": "Platform Track"}, "description": {}, "color": "#7A685B"}, {"id": 4, "name": {"en": "Platinum Sponsor Talk"}, "description": {}, "color": "#FF2172"}, {"id": 5, "name": {"en": "Core Team Track"}, "description": {}, "color": "#1AA6EA"}, {"id": 6, "name": {"en": "Birds-of-a-Feather (BoFs)"}, "description": {}, "color": "#BD79FB"}, {"id": 7, "name": {"en": "Reception"}, "description": {}, "color": "#0076AF"}, {"id": 8, "name": {"en": "Sponsor Talk"}, "description": {}, "color": "#2BB519"}, {"id": 9, "name": {"en": "Posters"}, "description": {}, "color": "#9B2732"}, {"id": 11, "name": {"en": "Application Track [featuring AI OnDemand]"}, "description": {}, "color": "#DB6524"}, {"id": 12, "name": {"en": "Core Team Track [featuring AI OnDemand]"}, "description": {}, "color": "#1AA6EA"}, {"id": 13, "name": {"en": "Posters [featuring AI OnDemand]"}, "description": {}, "color": "#9B2732"}, {"id": 14, "name": {"en": "Platinum Sponsor Talk [featuring AI OnDemand]"}, "description": {}, "color": "#FF2172"}], "rooms": [{"id": 1, "name": {"en": "Tsai Auditorium (CGIS S010)"}, "description": {"en": "S010"}}, {"id": 2, "name": {"en": "Belfer Case Study Room (CGIS S020)"}, "description": {"en": "S020"}}, {"id": 3, "name": {"en": "Lee Conference Room (CGIS S030)"}, "description": {"en": "S030"}}, {"id": 4, "name": {"en": "Kang Conference Room (CGIS S050)"}, "description": {"en": "S050"}}, {"id": 5, "name": {"en": "CGIS Concourse"}, "description": {}}], "speakers": [{"code": "8MLMLZ", "name": "Alan Chalker [Ohio Supercomputer Center]", "avatar": "https://cfp.openondemand.org/media/avatars/2024_chalker.3_axajcy7.jpg"}, {"code": "UNTF39", "name": "Len Wisniewski [Harvard]", "avatar": null}, {"code": "LUTE9X", "name": "Johnathan Lee [Arizona State University]", "avatar": "https://cfp.openondemand.org/media/avatars/54415756_AiovgN2.png"}, {"code": "LTACCL", "name": "Gulustan Dogan [University of North Carolina Wilmington]", "avatar": null}, {"code": "RNEZP8", "name": "Michael Dickens [Texas A&M University]", "avatar": "https://cfp.openondemand.org/media/avatars/Michael-Dickens-5_jvRp2q2.jpg"}, {"code": "MPPTM8", "name": "Yucheng Zhang [Tufts University]", "avatar": null}, {"code": "KPMTKJ", "name": "Sean Anderson [Wake Forest University]", "avatar": "https://cfp.openondemand.org/media/avatars/20230503anderson4-4K_cropped_small_2Kp2kLV.jpg"}, {"code": "FMJYUA", "name": "Jason L. Simms [Swarthmore College]", "avatar": "https://cfp.openondemand.org/media/avatars/simms-headshot-small_H5shd5Z.jpg"}, {"code": "LPKMRG", "name": "Jacob Boschee [University of British Columbia]", "avatar": "https://cfp.openondemand.org/media/avatars/UBC_20220126_PJ_1701_XOHsx3m.jpg"}, {"code": "MHPPMS", "name": "Huston Rogers [Mississippi State University]", "avatar": null}, {"code": "NK9DBW", "name": "Dean Anderson [Brigham Young University]", "avatar": "https://cfp.openondemand.org/media/avatars/bio_pic_W6ldysv.jpeg"}, {"code": "ZGCMS8", "name": "Julie Ma [Massachusetts Green High Performance Computing Center]", "avatar": null}, {"code": "EU7H8E", "name": "William Lai [Cornell]", "avatar": null}, {"code": "JX7ZVY", "name": "Vinay Saji Mathew [Pennsylvania State University]", "avatar": null}, {"code": "MVBZY3", "name": "Harry Smallbone [University of Western Australia]", "avatar": null}, {"code": "DNNSNU", "name": "Edwin Berbesi [Queen's University]", "avatar": null}, {"code": "CXPR3P", "name": "Maria del Carmen Heras Sanchez [University of Sonora]", "avatar": "https://cfp.openondemand.org/media/avatars/yo_bbVQAkt.jpg"}, {"code": "7HLYWH", "name": "Dori Sajdak [University at Buffalo]", "avatar": null}, {"code": "LEJNUU", "name": "Sarah L Duncan [Harvard]", "avatar": "https://www.gravatar.com/avatar/ae7c7adec9367ff6d2541148ccf5c205"}, {"code": "TKYXWR", "name": "Robin Karlsson [CSC - IT Center for Science]", "avatar": null}, {"code": "CXXGKD", "name": "Xavier Pillons [Microsoft]", "avatar": null}, {"code": "BZPBWJ", "name": "Morgan Ludwig [Cambridge Computer]", "avatar": null}, {"code": "Z8VTYR", "name": "Greg Nawrocki [Globus]", "avatar": null}, {"code": "M333SN", "name": "Alyza Rosario [University of British Columbia]", "avatar": null}, {"code": "J8PCFK", "name": "Jaime Cleek [Dartmouth]", "avatar": null}, {"code": "CYAMNS", "name": "Jeremy Guillette [Harvard]", "avatar": "https://cfp.openondemand.org/media/avatars/profile_pic_photo_SPnPHaB.jpg"}, {"code": "M7K9BW", "name": "Nick Choi [MathWorks]", "avatar": null}, {"code": "ZYBQ3V", "name": "Kyriakos Tsoukalas [Colgate University]", "avatar": null}, {"code": "RQFDCB", "name": "Raoul Jean Pierre Bonnal [IFOM ETS - The AIRC Institute of Molecular Oncology]", "avatar": "https://cfp.openondemand.org/media/avatars/avatar-round_5CkvTSp.png"}, {"code": "PXTCFR", "name": "Jonathan Halverson [Princeton]", "avatar": null}, {"code": "NTHXT8", "name": "Joe Ryan [Michigan State University]", "avatar": "https://cfp.openondemand.org/media/avatars/headshot_ttc1mlN.png"}, {"code": "LX93PT", "name": "Ryan Cox [Brigham Young University]", "avatar": null}, {"code": "F98XHJ", "name": "Owen Cochell [Michigan State University]", "avatar": "https://cfp.openondemand.org/media/avatars/gpic2_tctVfho.JPG"}, {"code": "LNWEAV", "name": "Maureen Dougherty [Ecosystem for Research Networking]", "avatar": null}, {"code": "VQJFCA", "name": "Jeaime Powell [Omnibond]", "avatar": "https://cfp.openondemand.org/media/avatars/JPowell-Photo24_rdqei6e.JPG"}, {"code": "FPVFN8", "name": "Cristiano Petrini [AIRC Institute of Molecular Oncology]", "avatar": "https://cfp.openondemand.org/media/avatars/FCL_12381_sdu1LxP.jpg"}, {"code": "WPF3NV", "name": "Rodgers Kimera [Research Data and Communication Technologies]", "avatar": null}, {"code": "3NQDY7", "name": "Simon Westersund [CSC - IT Center for Science]", "avatar": null}, {"code": "RB7MVU", "name": "Josko Plazonic [Princeton]", "avatar": null}, {"code": "W338JT", "name": "Richie Tan [Purdue]", "avatar": "https://cfp.openondemand.org/media/avatars/profile_picture_yOxypuk.jpeg"}, {"code": "KLCLLE", "name": "Ahmad Sheikhzada [University of Virginia]", "avatar": null}, {"code": "HDBJNV", "name": "Wei Feinstein [Lawrence Berkeley National Laboratory]", "avatar": "https://cfp.openondemand.org/media/avatars/yoga-small_tAm7AP9.jpg"}, {"code": "7ZKSVJ", "name": "Irene Kopaliani [Princeton]", "avatar": null}, {"code": "RKGAEH", "name": "Ben Eisenbraun [Harvard]", "avatar": "https://www.gravatar.com/avatar/2b0098ac6b814eea76662a422d1f0999"}, {"code": "MNGM9P", "name": "John-Paul Robinson [University of Alabama at Birmingham]", "avatar": "https://www.gravatar.com/avatar/c3ee01dfa184b81c32bf770e9b83afe1"}, {"code": "RBFG3Y", "name": "Karen Tomko [Ohio Supercomputer Center]", "avatar": "https://cfp.openondemand.org/media/avatars/Headshot-2023-cropped_MXkMkIm.png"}, {"code": "UU9PCJ", "name": "Thomas Drake-Brockman [Perth Children's Hospital]", "avatar": null}, {"code": "STL7KR", "name": "Paula C Sanematsu [Harvard]", "avatar": "https://cfp.openondemand.org/media/avatars/Paula_Sanematsu_QZFS5e4.jpg"}, {"code": "KPFWQA", "name": "Lisa Kempler [MathWorks]", "avatar": null}, {"code": "LGFWCA", "name": "Aday Bujeda [Harvard]", "avatar": null}, {"code": "7UPGTS", "name": "Ashley Dederich [University of Utah]", "avatar": "https://cfp.openondemand.org/media/avatars/Untitled_design.png_1IXwRux.PNG"}, {"code": "NMMEVT", "name": "Emily Moffat Sadeghi [Ohio Supercomputer Center]", "avatar": null}, {"code": "S8CX8K", "name": "Travis Ravert [Ohio Supercomputer Center]", "avatar": null}, {"code": "WHL8BQ", "name": "Jeff Ohrstrom [Ohio Supercomputer Center]", "avatar": null}, {"code": "ESGDLM", "name": "Marinus Pennings [Texas A&M University]", "avatar": null}, {"code": "BSWDGH", "name": "Michael Simon [Dell]", "avatar": "https://cfp.openondemand.org/media/avatars/Headshot_lUdvmF4.jpg"}, {"code": "EMVUF9", "name": "Sandeep Chandra [Stack Science]", "avatar": "https://cfp.openondemand.org/media/avatars/ChandraSandeep2_UNqx5Lb.jpg"}, {"code": "SN7WZJ", "name": "Sandra Gesing [Stack Science]", "avatar": "https://cfp.openondemand.org/media/avatars/Screenshot_2025-02-28_at_8.07.12_AM_egkUr5g.png"}, {"code": "AVHKKM", "name": "Chris Simmons [Cambridge Computer]", "avatar": "https://cfp.openondemand.org/media/avatars/Screenshot-2024-11-25-at-10.43.18AM-300x270_JZYk52j.png"}, {"code": "QQTEM8", "name": "Christian Bustelo", "avatar": "https://cfp.openondemand.org/media/avatars/profile_Sz7jADC.jpeg"}, {"code": "CY7CL3", "name": "Arturo Gimeno [Do IT Now]", "avatar": "https://cfp.openondemand.org/media/avatars/Screenshot_from_2025-03-11_10-44-29_KNsy6KJ.png"}, {"code": "XN8CCP", "name": "Justin Costa [OH-TECH]", "avatar": null}, {"code": "HEWF73", "name": "John Haag [Intel]", "avatar": null}]}